In [46]:
import pandas as pd

## Series

In [52]:
ser=pd.Series(['a','b','c','d','e'],[200,450,"Lhakpa","Dolma","Sherpa"])

In [54]:
print(ser)

200       a
450       b
Lhakpa    c
Dolma     d
Sherpa    e
dtype: object

In [56]:
ser.index

Index([200, 450, 'Lhakpa', 'Dolma', 'Sherpa'], dtype='object')

In [58]:
ser.loc[["Lhakpa","Dolma","Sherpa"]]

Lhakpa    c
Dolma     d
Sherpa    e
dtype: object

In [60]:
ser[[200]]

200    a
dtype: object

In [192]:
ser.iloc[2]

'c'

In [66]:
ser[[200]]*3

200    aaa
dtype: object

## Data frame

In [75]:
a={'one':pd.Series([10,20,30,40,50]),
   'two':pd.Series([-10,-20,-30,-40,-50])
  }

In [79]:
df=pd.DataFrame(a)

In [81]:
print(df)

   one  two
0   10  -10
1   20  -20
2   30  -30
3   40  -40
4   50  -50

In [85]:
a={'one':pd.Series([10,20,30,40,50],index=['a','b','c','d','e']),
   'two':pd.Series([-10,-20,-30,-40,-50],index=['a','b','c','d','e'])
  }

In [103]:
df=pd.DataFrame(a)

In [105]:
print(df)

   one  two
a   10  -10
b   20  -20
c   30  -30
d   40  -40
e   50  -50

In [107]:
df

   one  two
a   10  -10
b   20  -20
c   30  -30
d   40  -40
e   50  -50

In [109]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [111]:
df.loc['d']

one    40
two   -40
Name: d, dtype: int64

In [123]:
b={'english':pd.Series([60,89,79,37,50],index=['angel','baby','champa','dang','eve']),
   'math':pd.Series([10,20,90,40,50],index=['angel','baby','champa','dang','eve']),
   'science':pd.Series([50,60,70,80,90],index=['angel','baby','champa','dang','eve'])
  }

In [125]:
ad=pd.DataFrame(b)

In [127]:
ad

        english  math  science
angel        60    10       50
baby         89    20       60
champa       79    90       70
dang         37    40       80
eve          50    50       90

In [129]:
ad.iloc[2]

english    79
math       90
science    70
Name: champa, dtype: int64

In [ ]:
b={'english':pd.Series([60,89,79,37,50]),
   'math':pd.Series([10,20,90,40,50]),
   'science':pd.Series([50,60,70,80,90])
  }

In [143]:
ad=pd.DataFrame(b,index=['angel','baby','champa','dang','eve'])

In [151]:
ad

        english  math  science
angel       NaN   NaN      NaN
baby        NaN   NaN      NaN
champa      NaN   NaN      NaN
dang        NaN   NaN      NaN
eve         NaN   NaN      NaN

In [155]:
data=[{'ram':100,'shyam':150},{'rita':50,'gita':80}]

In [157]:
df1=pd.DataFrame(data)

In [159]:
df1

     ram  shyam  rita  gita
0  100.0  150.0   NaN   NaN
1    NaN    NaN  50.0  80.0

In [161]:
df2=pd.DataFrame(data,columns=['ram','rita'])

In [163]:
df2

     ram  rita
0  100.0   NaN
1    NaN  50.0

In [180]:
b={'english':([60,89,79,37,50]),
   'math':([10,20,90,40,50]),
   'science':([50,60,70,80,90])
  }
marks=pd.DataFrame(b,index=['tenzin','dawa','lhakpa','tsering','hero'])

In [182]:
marks

         english  math  science
tenzin        60    10       50
dawa          89    20       60
lhakpa        79    90       70
tsering       37    40       80
hero          50    50       90

## head & tail

In [172]:
type(marks)

pandas.core.frame.DataFrame

In [184]:
marks.head()

         english  math  science
tenzin        60    10       50
dawa          89    20       60
lhakpa        79    90       70
tsering       37    40       80
hero          50    50       90

In [186]:
marks.tail()

         english  math  science
tenzin        60    10       50
dawa          89    20       60
lhakpa        79    90       70
tsering       37    40       80
hero          50    50       90

In [190]:
marks.tail()

         english  math  science
tenzin        60    10       50
dawa          89    20       60
lhakpa        79    90       70
tsering       37    40       80
hero          50    50       90